<template>
  <div class="privacy">
    <div class="container">
      <h1 class="privacy__heading">Политика конфиденциальности</h1>
      <div class="privacy__items">
        <p><!---->1. Общие положения</p>
        <p>
          <!---->1.1. Настоящая Политика конфиденциальности (далее — «Политика»)
          разработана в соответствии с Федеральным законом от 27.07.2006 №
          152-ФЗ «О персональных данных» (далее — «152-ФЗ»).
        </p>
        <p>
          <!---->1.2. Данный демонстрационный веб-сайт (далее — «Сайт») не
          собирает, не хранит и не обрабатывает персональные данные
          Пользователей в понимании ст. 3 152-ФЗ.
        </p>

        <p><!---->2. Демо‑аккаунты</p>
        <p>
          <!---->2.1. Все доступные учётные записи созданы заранее, обезличены,
          не содержат информации о реальных лицах и используются исключительно
          для демонстрации функционала.
        </p>
        <p>
          <!---->2.2. Пользователи не могут изменять персональные данные
          Демо‑аккаунтов или добавлять собственные персональные данные.
        </p>
        <p><!---->2.3. Пользователи не могут создавать учетные записи.</p>
        <p><!---->3. Cookie и техническая информация</p>
        <p>
          <!---->3.1. На Сайте применяются только технически необходимые cookie,
          обеспечивающие работу сессии в рамках демонстрации.
        </p>
        <p>
          <!---->3.2. Cookie не используются для аналитики, рекламы или
          отслеживания действий Пользователей.
        </p>
        <p>
          <!---->3.3. IP-адреса Пользователей не фиксируются и не сохраняются ни
          в каком виде в рамках этого Сайта.
        </p>

        <p><!---->4. Передача данных третьим лицам</p>
        <p>
          <!---->4.1. Поскольку персональные данные не собираются, их передача
          третьим лицам не осуществляется.
        </p>

        <p><!---->5. Изменения Политики</p>
        <p>
          <!---->5.1. Администрация оставляет за собой право вносить изменения в
          Политику без предварительного уведомления. Изменения вступают в силу с
          момента публикации новой редакции на Сайте.
        </p>
        <p><!---->5.2. Актуальная версия Политики всегда доступна на Сайте.</p>

        <p><!---->6. Дата вступления в силу</p>
        <p>
          <!---->6.1. Настоящая Политика действует с 06.09.2025 и до замены
          новой редакцией.
        </p>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
  .privacy {
    &__heading {
      margin-bottom: 32px;
    }

    &__items {
      overflow-wrap: break-word;
      white-space: pre-wrap;
      font-size: 18px;
      line-height: 32px;
      color: rgb(209, 190, 190);

      > p {
        margin-top: 8px;
      }
    }
  }
</style>
