<template>
  <div class="terms">
    <div class="container">
      <h1 class="terms__heading">Пользовательское соглашение</h1>
      <div class="terms__items">
        <p><!---->1. Общие положения</p>
        <p>
          <!---->1.1. Настоящее Пользовательское соглашение (далее —
          «Соглашение») регулирует порядок использования демонстрационного
          веб‑сайта (далее — «Сайт»).
        </p>
        <p>
          <!---->1.2. Сайт предназначен исключительно для демонстрации
          функционала программного обеспечения и не является коммерческим
          сервисом.
        </p>
        <p>
          <!---->1.3. Используя Сайт, Пользователь подтверждает, что ознакомился
          с условиями Соглашения и обязуется их соблюдать.
        </p>

        <p><!---->2. Доступ к функционалу</p>
        <p>
          <!---->2.1. Для входа используются только заранее созданные тестовые
          учётные записи (далее — «Демо‑аккаунты»), предоставленные
          Администрацией Сайта.
        </p>
        <p><!---->2.2. Регистрация новых пользователей не предусмотрена.</p>

        <p><!---->3. Запрещённые действия</p>
        <p>
          <!---->3.1. Пользователю запрещается вводить в поля форм любые
          персональные данные, относящиеся к себе или третьим лицам, в понимании
          ст. 3 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных
          данных».
        </p>
        <p>
          <!---->3.2. Запрещается использовать Сайт для целей, не связанных с
          демонстрацией его функционала.
        </p>

        <p><!---->4. Ограничение ответственности</p>
        <p>
          <!---->4.1. Администрация не несёт ответственности за любые данные,
          введённые Пользователем в нарушение настоящего Соглашения.
        </p>
        <p>
          <!---->4.2. Сайт предоставляется «как есть» без каких‑либо гарантий.
        </p>

        <p><!---->5. Ответственность пользователя</p>
        <p>
          <!---->5.1. Пользователь несёт полную ответственность за соблюдение
          условий настоящего Соглашения и за все действия, совершённые с
          использованием Демо‑аккаунта.
        </p>
        <p><!---->6. Заключительные положения</p>
        <p>
          <!---->6.1. Настоящее Соглашение вступает в силу с момента публикации
          на Сайте.
        </p>
        <p>
          <!---->6.2. Актуальная версия Соглашения всегда доступна на Сайте.
        </p>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
  .terms {
    &__heading {
      margin-bottom: 32px;
    }

    &__items {
      overflow-wrap: break-word;
      white-space: pre-wrap;
      font-size: 18px;
      line-height: 32px;
      color: rgb(209, 190, 190);

      > p {
        margin-top: 8px;
      }
    }
  }
</style>
